<template>
  <div>
    <h3>{{ unitTitle }}</h3>
    <div v-for="faq in faqList" :key="faq.key">
      <div class="d-flex align-stretch">
        <v-icon>{{ icons.question }}</v-icon>
        <p>{{ faq.question }}</p>
      </div>
      <div class="d-flex align-stretch">
        <v-icon>{{ icons.answer }}</v-icon>
        <p>{{ faq.answer }}</p>
      </div>
    </div>
  </div>
</template>

<script lang="ts">
import Vue from "vue";
import { mdiAlphaQCircle, mdiAlphaACircle } from "@mdi/js";

export default Vue.extend({
  data: () => ({
    unitTitle: "FAQ",
    icons: {
      question: mdiAlphaQCircle,
      answer: mdiAlphaACircle
    },
    faqList: [
      {
        key: 0,
        name: "what-can-i-do-with-this-app",
        question: "このアプリでは何ができますか？",
        answer:
          "体温の記録を通常のDBとブロックチェーン双方に記録しておくことができます。"
      },
      {
        key: 1,
        name: "why-blockchain",
        question:
          "通常のDBに加え、ブロックチェーンにも記録しておく意味は何ですか？",
        answer:
          "ブロックチェーンに一旦記録されたデータは、後から改竄することがとても難しいため、記録されたデータが改竄されていないことを証明できます。これは記録された情報の信頼性を高められることを意味します。"
      },
      {
        key: 2,
        name: "what-kind-of-blockchain-platform-is-used",
        question: "何のブロックチェーンプラットフォームを使用していますか？",
        answer:
          "NEM(NIS1)を使用しています。開発が極めて容易であること、約5年間にわたる安定した稼働実績があること、このアプリの開発者が個人的に慣れ親しんだ技術であることから、NEM(NIS1)を使用しています。"
      },
      {
        key: 3,
        name: "how-it-works",
        question: "仕組みについて簡単に教えてください。",
        answer: `記録に残しておきたい体温を入力頂き、「保存」ボタンをタップ or クリックして頂くと、まず、NEM(NIS1)ブロックチェーン上の開発者のアドレスへ体温の情報をメッセージとして含むトランザクションを発行して頂きます。
        この時、アドレス、秘密鍵の入力を求められますが、秘密鍵はサーバー側では一切保存せず、ブラウザ上のメモリのみに展開され、署名等の処理が行われます。
        トランザクションが正常に処理されたことを確認後、同じデータを、トランザクションの情報(トランザクションのハッシュ)とともに通常のDBに保存します。
        以降は通常の利用時には、通常のDBに保存されたデータを用いて過去の履歴の表示等を行うことができるとともに、厳格な証明が必要とされる場合にはブロックチェーンに記録したトランザクションの情報を提示することで、情報が改竄されていないことを証明することが可能です。`
      },
      {
        key: 4,
        name: "is-it-safe-especially-handling-private-key",
        question:
          "秘密鍵をWebアプリに直接入力することにはセキュリティ的に不安があります。本当に安全ですか？",
        answer: `大変申し訳ありませんが、100%の安全を保証することはできません。
        しかし、サーバー上には秘密鍵を保存しない、ネットワークを通じて秘密鍵を送信しない等、可能な限りセキュリティに配慮して、開発・運用しているつもりです。
        ただし、お客様自身の端末がマルウェアに感染していたり、悪意のある外部ユーザーに侵入されていたりした場合、お客様の端末のブラウザ上のメモリを読み取られる等の手法で、秘密鍵が意図せず漏洩してしまうリスクは否定できません。
        そういった事故を防ぐには、不審なアプリのインストールや不審なサイトへのアクセスを行わない等といった取組や意識が大切です。`
      },
      {
        key: 5,
        name: "how-it-costs",
        question: "利用するのに料金はかかりますか？",
        answer: `トランザクションの発行に1回あたり最低0.05XEMの手数料が必要です。1日1回のペースで体温を記録し、1ヶ月(仮に30日)使用した場合、1.5XEMの手数料が必要です。`
      },
      {
        key: 6,
        name: "what-is-contributions",
        question: "寄付とは何ですか？どのような仕組みですか？",
        answer: `初期設定では体温を記録するトランザクションの際は、XEMの送金額は0XEMと設定されており、開発者が受け取る手数料はありません。もしこのアプリが「いいね！」と思っていただけた場合や、長期的に使用し続けたいという方いらっしゃいましたら、開発者のモチベーションのためにもぜひ寄付を頂けるととても嬉しいです！寄付の方法は二種類あり、体温を記録する毎に少額ずつ寄付して頂く方法と、開発者のアドレス宛に直接寄付して頂く方法の2種類があります。皆様の寄付をお待ちしております！`
      }
    ]
  })
});
</script>
